posts/2008-12-12-todays-news.org
#+date: <2008-12-12>
#+title: Todays News
#+filetags: technology army

Two stories in today’s news caught my attention. First, Britain’s /[[http://www.independent.co.uk/life-style/gadgets-and-tech/features/the-ipod-its-bound-to-fail-and-the-other-predictions-the-experts-would-rather-forget-1061286.html][The Independent ]]/reports on history’s most famous failed technology predictions. These include a claim from 1977 that no one will need a computer in their home.
    
The second story, in the [[http://www.washingtonpost.com/wp-dyn/content/article/2008/12/11/AR2008121104080_pf.html][Washington Post]], is a harrowing account of an assault conducted by U. S. Special Forces soldiers and Afghan commandos on an insurgent stronghold in Afghanistan. Ten of those soldiers will receive the Silver Star today. 
    


#+begin_tagline
Tagged: technology army
#+end_tagline
