docs/posts/2008-12-12-todays-news.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 23, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Todays News</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Todays News</h1>
<p class="subtitle" role="doc-subtitle">Dec 12, 2008</p>
</header><p>
Two stories in today’s news caught my attention. First, Britain’s /<a href="http://www.independent.co.uk/life-style/gadgets-and-tech/features/the-ipod-its-bound-to-fail-and-the-other-predictions-the-experts-would-rather-forget-1061286.html">The Independent </a>/reports on history’s most famous failed technology predictions. These include a claim from 1977 that no one will need a computer in their home.
</p>

<p>
The second story, in the <a href="http://www.washingtonpost.com/wp-dyn/content/article/2008/12/11/AR2008121104080_pf.html">Washington Post</a>, is a harrowing account of an assault conducted by U. S. Special Forces soldiers and Afghan commandos on an insurgent stronghold in Afghanistan. Ten of those soldiers will receive the Silver Star today. 
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 23, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
